* Generating some Lisp code using Lisp
#+BEGIN_SRC lisp :results raw
(list 'progn
  '(setf foo 42)
  '(print "setted foo")
  (lisp-implementation-type))
#+END_SRC
#+RESULTS:
(PROGN (SETF FOO 42) (PRINT "setted foo") "SBCL")
* Can define macros this way, too
#+BEGIN_SRC lisp :results none
(defmacro my-macro ()
   (list 'progn '(setf foo 42) '(print "setted foo") (lisp-implementation-type)))
#+END_SRC
Then, testing with MACROEXPAND-1:
#+BEGIN_SRC lisp :results raw
(macroexpand-1 '(my-macro))
#+END_SRC
#+RESULTS:
(PROGN (SETF FOO 42) (PRINT "setted foo") "SBCL")
** GENSYM to the rescue

 - need a uniquely generated symbol for our temp-var so we don't clash

#+BEGIN_SRC lisp :results raw
(loop repeat 5 collect (gensym))
#+END_SRC
#+RESULTS:
(#:G696 #:G697 #:G698 #:G699 #:G700)

